artillery-reactive.yaml

config:
  target: "http://localhost:8080"
  http:
    timeout: 120
    extendedMetrics: true
  phases:
  - duration: 10
    arrivalRate: 2
    name: Warm up
  - duration: 180
    arrivalRate: 2
    rampTo: 100
    name: Ramp up load
  - duration: 180
    arrivalRate: 100
    name: Sustained load

scenarios:
  - name: "Retrieve Users"
    flow:
      - get:
          url: "/users"